[
  {
    "id": "pre_admin",
    "title": "Pre-Job & Admin",
    "scopeRef": "Ch.1–2",
    "tasks": [
      { "id": "1.05", "text": "Confirm Supplier Master Agreement is in place before work begins." },
      { "id": "portal", "text": "Verify access to Walmart Web Portal, ST Technical Document Center, and Security Technology Projects site." },
      { "id": "docs_pkg", "text": "Download and have onsite: device location drawings, wiring details, cable assignment sheet, and BOM for this project." },
      { "id": "licenses", "text": "Confirm all required state/local licenses & permits are valid and available for review (AHJ & Security Manager)." },
      { "id": "training", "text": "Verify all onsite personnel have OSHA-10 and onsite supervisor has OSHA-30; carry cards onsite." },
      { "id": "manager_rep", "text": "Assign a project representative (manager) as the single point of contact with Security Manager & project team." },
      { "id": "auth_list", "text": "After pre-possession meeting: send Authorized Employee List + licenses + OSHA cards to GC, Store Planner, and Security Manager; upload to Portal." }
    ]
  },
  {
    "id": "timeline_updates",
    "title": "Timeline & Weekly Updates",
    "scopeRef": "3.09–3.14, 5.07–5.11",
    "tasks": [
      { "id": "timeline_form", "text": "Within 5 days of project start, complete Walmart Project Timeline/Gantt form and send to Security Manager + upload to Portal." },
      { "id": "substantial_completion", "text": "Plan work so substantial completion is 14 days before GO, with AHJ inspections completed 7 days before GO." },
      { "id": "weekly_update", "text": "Send weekly update email (one per project) to Security Manager and upload to Portal by Thursday 5 PM." },
      { "id": "issues_flag", "text": "Immediately communicate any issues that could impact progress or completion date in the weekly update." },
      { "id": "50pct_pay", "text": "Ensure weekly update form is complete and accurate if requesting 50% progress payment at ~60% install completion." }
    ]
  },
  {
    "id": "safety_coord",
    "title": "Safety, Badging & Coordination",
    "scopeRef": "3.00–3.08, 2.06–2.21",
    "tasks": [
      { "id": "safety_meeting_gc", "text": "Meet with GC to review Walmart/site-specific safety requirements before starting work; follow GC safety program." },
      { "id": "ppe_spotters", "text": "Provide spotters for lifts and ensure all personnel wear required PPE (vest, hard hat, etc.) at all times." },
      { "id": "badges", "text": "Ensure all techs wear company photo ID and project badge visibly on outer garment while onsite." },
      { "id": "daily_meeting", "text": "Attend daily morning GC/store planning meetings or check-in call when offsite." },
      { "id": "no_wm_equip", "text": "Do not use Walmart ladders, lifts, shopping carts, or other store property for installation work." },
      { "id": "clean_work", "text": "Keep work areas clean and free of debris; clean each workspace and lift/container area daily." },
      { "id": "damage_repair", "text": "Document and repair any damage caused by installation (walls, paint, ceilings, etc.) as required." }
    ]
  },
  {
    "id": "demo_remodel",
    "title": "Remodel / Demo Tasks",
    "scopeRef": "3.21–3.28",
    "tasks": [
      { "id": "pre_inspection_cctv", "text": "Perform pre-inspection of existing CCTV/alarm system (photos + quick test) before starting work; upload to Portal within 7 days." },
      { "id": "demo_scope", "text": "Plan demolition of unused system components per drawings; remove unused cameras, racks, and head-end gear." },
      { "id": "ceiling_tiles", "text": "Be prepared to replace ceiling tiles in pharmacy, service desk, front registers for drop ceiling stores as required." },
      { "id": "exterior_cam_paint", "text": "If building exterior is painted, clean and readjust exterior cameras as needed." },
      { "id": "used_assets", "text": "Box or palletize unused equipment and complete ST Used Assets Return Manifest for claims associate." }
    ]
  },
  {
    "id": "cabling",
    "title": "Cabling & Conduit",
    "scopeRef": "3.29–3.68",
    "tasks": [
      { "id": "supports", "text": "Install cable with proper supports (bridle rings/J-hooks/grid wire) and maintain required clearances from roof deck and ceilings." },
      { "id": "no_shared_pathways", "text": "Keep fire, data, CCTV and other systems in separate conduits/trays/supports; no shared pathways." },
      { "id": "conduit_rules", "text": "Provide low-voltage conduits where needed, deburred with bushings; seal cooler/freezer/exterior conduits with proper rated sealant." },
      { "id": "service_loops", "text": "Provide 20 ft service loops for UTP at device, neat 6\" coil; limit alarm device loops to 1 ft max." },
      { "id": "cable_length", "text": "Keep UTP runs ≤ 90 m (permanent link) and ≤ 100 m including patch cords; keep alarm circuits within 80% of rated length/load." },
      { "id": "wire_sizes", "text": "Use Cat5e or better for CCTV and 18 AWG minimum for alarm; avoid T-taps on alarm circuits." },
      { "id": "labeling", "text": "Label both ends of each cable with machine-printed, self-laminating labels (e.g., CCTV-01-GM, device/loop IDs for alarm)." },
      { "id": "head_end_dressing", "text": "Route all head-end cabling through wire management or conduit, Velcro for UTP, neatly dressed and protected from damage." }
    ]
  },
  {
    "id": "cctv_install",
    "title": "CCTV Install & Missed Scan",
    "scopeRef": "6.00–6.22",
    "tasks": [
      { "id": "pre_screenshots", "text": "Take screenshots of all existing cameras before work; upload PDF to Portal within 7 days." },
      { "id": "master_cable_sheet", "text": "Maintain Master Cable Assignment Sheet with switch/port/device/IP/MAC and keep updated in DVRPC C:\\data folder." },
      { "id": "patch_panels", "text": "Terminate all camera UTP to patch panels and use yellow patch cords to switches; no direct-to-switch terminations." },
      { "id": "wacher_ports", "text": "Coordinate port programming with Wachter NOC via email; plan to minimize number of contacts." },
      { "id": "exterior_height", "text": "Mount exterior fixed cameras so lens is 12.5 ft AFF; follow conduit and sealing requirements for exterior boxes." },
      { "id": "vestibule_rules", "text": "Mount vestibule cameras at 6 ft AFF (unless approved otherwise), with ½\" EMT to accessible space and distances from glass (18\" side, 24\" top)." },
      { "id": "ptz_mounting", "text": "Mount PTZs at bottom of bar joist height with appropriate Unistrut/pendant hardware and verify FOV and control." },
      { "id": "missed_scan", "text": "Install Missed Scan cameras centered on POS glass, mounted to stable structure, and submit IP map + FOV screenshots (4 per page) within 5 days of final register layout." }
    ]
  },
  {
    "id": "pvm_vms",
    "title": "PVMs, VMS & DVRPC",
    "scopeRef": "6.23–6.32",
    "tasks": [
      { "id": "pvm_pendant", "text": "Install pendant PVMs with secure attachment to bar joists and correct power/decoder connections." },
      { "id": "pvm_wall", "text": "Install wall PVMs with mounts and HDMI/decoder connections per drawings." },
      { "id": "pvm_height", "text": "Ensure lowest point of all monitors is 8 ft AFF (10 ft for Sam’s Clubs)." },
      { "id": "vms_program", "text": "Program cameras into Verint (or March, if applicable) per CSV/cable assignment sheet and Walmart VMS guides." },
      { "id": "dvrpc_install", "text": "Install DVRPC in AP or UPC office in week 1, run full install script before power-down, and connect all monitors/printers properly." }
    ]
  },
  {
    "id": "cctv_closeout",
    "title": "CCTV Close-Out & Training",
    "scopeRef": "6.33–6.43",
    "tasks": [
      { "id": "verify_all_cams", "text": "Verify every camera is online, properly named, focused, and recording before final punch with Security Manager." },
      { "id": "fov_docs", "text": "Capture and save FOV screenshots for each camera in required PDF layout (including POS and Missed Scan maps)." },
      { "id": "rack_photos", "text": "Take photos of front and back of each IDF/TC rack showing neat cabling and labeling." },
      { "id": "service_binder", "text": "Build and leave CCTV Service Binder in AP office with manuals, redline as-builts, Master Cable Assignment, and checklists." },
      { "id": "48hr_test", "text": "Run a minimum 48-hour endurance test on the CCTV system and correct any issues before final acceptance." },
      { "id": "cctv_training", "text": "Provide CCTV operator training for onsite staff (up to 2 sessions, 2 hrs each, normal business hours)." }
    ]
  },
  {
    "id": "alarm_install",
    "title": "Alarm Install & Testing",
    "scopeRef": "7.00–7.16, 7.22–7.23",
    "tasks": [
      { "id": "alarm_precheck", "text": "Perform visual and functional pre-inspection of alarm system (RTUs, faults, supervisory signals) and report non-operable points within 5 days." },
      { "id": "on_test", "text": "Always place alarm system on test via VRT/management/Alarm Central before work begins and notify store management." },
      { "id": "off_test", "text": "Remove system from test before leaving each day; verify normal status on keypads and notification circuits." },
      { "id": "no_strapping", "text": "Do not strap out points to force normal; have Alarm Central D-pop points that will remain abnormal, track all ticket numbers." },
      { "id": "fire_backboard", "text": "Install or extend fire alarm backboard (fire-rated, painted) and gutters per proto layouts and scope for this store type." },
      { "id": "battery_test", "text": "Perform stand-alone battery test as part of final 48-hour alarm system test." }
    ]
  },
  {
    "id": "alarm_closeout",
    "title": "Alarm Close-Out & Docs",
    "scopeRef": "7.18–7.29",
    "tasks": [
      { "id": "as_builts_alarm", "text": "Create separate fire and intrusion as-builts with wiring paths, splices, devices, and all deviations from prints." },
      { "id": "ahj_docs", "text": "Obtain and file closed permits, AHJ sign-off documents, and any required state/jurisdiction tags or certifications." },
      { "id": "test_signals", "text": "Send and document test signals from Alarm Central showing each point tested; ensure no missing or grouped points." },
      { "id": "zone_maps", "text": "Install framed alarm zone map at main keypad/annunciator, updated to match as-builts and code; remove intrusion maps if present." },
      { "id": "alarm_binder", "text": "Place binder in panel document enclosure with all alarm close-out docs, stamped prints, as-builts, manuals, and checklists." },
      { "id": "alarm_training", "text": "Provide alarm system training to store management per Walmart alarm training guide, with at least two sessions if needed." }
    ]
  },
  {
    "id": "logistics_equipment",
    "title": "Logistics, Equipment & RMA",
    "scopeRef": "Ch.4",
    "tasks": [
      { "id": "inventory_delivery", "text": "Inventory all received equipment against POD, BOM, and prints within 48 hours; upload POD and inventory to Portal within 5 days." },
      { "id": "storage", "text": "Provide secure storage (no Walmart interior storage) and protect all equipment from weather/theft; confirm pallet count vs container size." },
      { "id": "excess_equipment", "text": "Review excess equipment with Security Manager and arrange returns via STAR or vendor RMA as required." },
      { "id": "loss_reporting", "text": "Report any equipment loss/damage to Security Manager; understand replacement costs may be deducted from payment." },
      { "id": "container_removal", "text": "Ensure storage containers and equipment are removed from site at least one week prior to grand opening." }
    ]
  }
]
